app/controllers/order_items_controller.rb

  def create
    @order = current_order
    @order_item = @order.order_items.new(order_item_params)

    if @order.save!
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1  [["order_id", 1]]
INSERT INTO "order_items" ("product_id", "order_id", "unit_price", "quantity", "total_price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["product_id", 2], ["order_id", 1], ["unit_price", "33.9"], ["quantity", 1], ["total_price", "33.9"], ["created_at", "2018-09-14 22:19:38.682897"], ["updated_at", "2018-09-14 22:19:38.682897"]]
INSERT INTO "orders" ("subtotal", "order_status_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["subtotal", "33.9"], ["order_status_id", 1], ["created_at", "2018-09-14 22:19:38.669003"], ["updated_at", "2018-09-14 22:19:38.669003"]]

  def update
    @order = current_order
    @order_item = @order.order_items.find(params[:id])
    @order_item.update_attributes(order_item_params)
---
SELECT  "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1 AND "order_items"."id" = $2 LIMIT $3  [["order_id", 1], ["id", 11], ["LIMIT", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "order_items" SET "quantity" = $1, "total_price" = $2, "updated_at" = $3 WHERE "order_items"."id" = $4  [["quantity", 2], ["total_price", "67.8"], ["updated_at", "2018-09-14 23:23:04.024676"], ["id", 11]]

  def destroy
    @order = current_order
    @order_item = @order.order_items.find(params[:id])
    @order_item.destroy
---
SELECT  "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1 AND "order_items"."id" = $2 LIMIT $3  [["order_id", 1], ["id", 11], ["LIMIT", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "order_items" WHERE "order_items"."id" = $1  [["id", 11]]