app/views/layouts/_cart_text.html.haml

= link_to "#{current_order.order_items.size} Items in E-Basket ( SubTotal: #{number_to_currency current_order.subtotal }, Total : #{number_to_currency current_order.total} with VAT[discount@12% on more than $70 ])", cart_path, class: "btn btn-link"
---
SELECT  "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1 AND "order_items"."id" = $2 LIMIT $3  [["order_id", 1], ["id", 11], ["LIMIT", 1]]
SELECT COUNT(*) FROM "order_items" WHERE "order_items"."order_id" = $1  [["order_id", 1]]